MSG_WELCOME = 'Вітаємо на нашій вікторині.'
MSG_USERNAME_REQUEST = 'Ваше імʼя'
MSG_THANKS = 'Дякуємо за участь у нашій вікторині. Гарного вам дня!'
MSG_RESULT = '<h2>Вітаю, {username}</h2>ваша оцінка становить <b>{score}</b> балла/баллів'

QUESTION_1 = 'Коли почалась друга світова війна?'
QUESTION_1_ANSWER = 1939

QUESTION_2 = 'Через яку країну почалася 1 світова війна? (написати потрібно тільки назву країни)'
QUESTION_2_ANSWER = 'Австріїська імперія'

QUESTION_3 = 'Коли Українська Народна Республіка (УНР) стала незалежною?'
QUESTION_3_ANSWER = 1917

QUESTION_4 = 'В честь кого назвали Напалеоновскі воїни? (писати поотрібно так: "В честь (імʼя правителя)"'
QUESTION_4_ANSWER = 'В честь Напалеона Бонапарта'

QUESTION_5 = 'Хто відкрив шлях до Індії?'
QUESTION_5_ANSWER = 'Васко да Гама'
